# Step 3

In [1]:
#import all libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
#create shortcut
path=r'/Users/coley/Desktop/Data Analyst School/Achievement 4/Instacart Basket Analysis'

In [3]:
#import dataframe from csv file
customers=pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'),index_col=False)

# Step 4

In [4]:
#check column titles
customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [5]:
#rename Surnam/Last Name column
customers.rename(columns={'Surnam':'Last Name'},inplace=True)

In [6]:
#rename STATE/State column
customers.rename(columns={'STATE':'State'},inplace=True)

In [7]:
#check column titles after edits
customers.head()

,user_id,First Name,Last Name,Gender,State,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# Step 5

In [8]:
#check dataframe shape
customers.shape

(206209, 10)

In [13]:
#check dataframe data types
customers.dtypes

user_id         object
First Name      object
Last Name       object
Gender          object
State           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [12]:
#change data type for user id column to string/object
customers['user_id'] = customers['user_id'].astype('str')

In [14]:
#check for null/missing data
customers.isnull().sum()

user_id             0
First Name      11259
Last Name           0
Gender              0
State               0
Age                 0
date_joined         0
n_dependants        0
fam_status          0
income              0
dtype: int64

since only missing data is for first names - there is no need to find or correct this data since first names will not change results in looking into gender, state, age, date joined, number of dependents, family status, and income along with the user id which we would use in order to keep names of customers private

In [15]:
#check descriptive statistics
customers.describe()

                 Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000
mean       49.501646       1.499823   94632.852548
std        18.480962       1.118433   42473.786988
min        18.000000       0.000000   25903.000000
25%        33.000000       0.000000   59874.000000
50%        49.000000       1.000000   93547.000000
75%        66.000000       3.000000  124244.000000
max        81.000000       3.000000  593901.000000

looking at mins and maxs, data looks to have no errors since mins and maxs are in range for their specific columns
(example - min age is 18 and max age is 81)

In [16]:
#check for duplicates
dups = customers[customers.duplicated()]

In [18]:
dups.shape

(0, 10)

there are no duplicates that need removed

# Step 6

In [19]:
#import prepared instacart data
instacart=pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_merged_from_task_4_8.pkl'))

In [20]:
#check data type for user id column to be sure it matches other dataframe
instacart.dtypes

Unnamed: 0                   int64
product_id                   int64
product_name                object
aisle_id                     int64
department_id                int64
prices                     float64
order_id                     int64
user_id                      int64
eval_set                    object
order_number                 int64
order_dow                    int64
order_hour_of_day            int64
days_since_prior_order     float64
add_to_cart_order            int64
reordered                    int64
_merge                    category
price_range_loc             object
busiest day                 object
busiest days                object
busiest_period_of_day       object
max_order                    int64
loyalty_flag                object
spending                   float64
spending_flag               object
frequency                  float64
order_frequency_flag        object
dtype: object

In [22]:
#change user id column data type to string/object
instacart['user_id'] = instacart['user_id'].astype('str')

In [23]:
#merge customers and instacart data
merged = customers.merge(instacart, on='user_id')

In [24]:
#check that dataframes merged
merged.head()

,user_id,First Name,Last Name,Gender,State,Age,date_joined,n_dependants,fam_status,income,...,price_range_loc,busiest day,busiest days,busiest_period_of_day,max_order,loyalty_flag,spending,spending_flag,frequency,order_frequency_flag
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Mid-range product,Regularly busy,Busiest days,Most Orders,8,New customer,7.988889,Low Spender,19.0,Regular customer
1,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Mid-range product,Regularly busy,Regular days,Most Orders,8,New customer,7.988889,Low Spender,19.0,Regular customer
2,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Mid-range product,Regularly busy,Busiest days,Most Orders,8,New customer,7.988889,Low Spender,19.0,Regular customer
3,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Low-range product,Regularly busy,Regular days,Most Orders,8,New customer,7.988889,Low Spender,19.0,Regular customer
4,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Low-range product,Regularly busy,Slowest days,Most Orders,8,New customer,7.988889,Low Spender,19.0,Regular customer

# Step 8

In [25]:
#export merged dataframe into pkl file
merged.to_pickle(os.path.join(path,'02 Data','Prepared Data','customers_orders.pkl'))